{
  "itrelated" : [
    {
      "show" : true,
      "is_current" : true,
      "position" : "Associate Product Owner",
      "company" : "Cavista Technology - Philippines",
      "division" : "Product Team - Internal Applications",
      "duration" : "May 2022 - August 2022",
      "duties" : [
        "Consistently ensure product roadmaps, backlogs, and release plans comply with Agile methodologies, concepts, and principles.",
        "Independently managed a multidisciplinary global software engineering team during Daily Scrum, Sprint Planning, Backlog Refinement, and Sprint Retrospective.",
        "Communicated engineering productivity and feature progress to the product stakeholders.",
        "Clearly defined and verify requirements, story implementation goals, and product performance from key stakeholders."
      ],
      "achievements": [
        "Crafted multiple Release Notes which are also utilized by other teams for their reference.",
        "Complete adherence to the planned release schedule with 100% approval rate of the product stakeholders."
      ]
    },
    {
      "show" : true,
      "is_current" : false,
      "position" : "Product Owner and Coordinator",
      "company" : "Cavista Technology - Philippines",
      "division" : "Product Team - Internal Applications",
      "duration" : "May 2021 - May 2022",
      "duties" : [
        "Planed and prioritized product feature backlogs and sets the target release and delivery of each.",
        "Provided an active role in mitigating impediments impacting successful team completion of Release/Sprint Goals.",
        "Communicated engineering productivity and feature progress to the product stakeholders.",
        "Provided visibility on product vision and strategy to the engineering team."
      ],
      "achievements": [
        "Spearheaded the creation of work instruction manuals for the existing and common processes of the team.",
        "Crafted template for the Release Approval tickets of the team which was also utilized by other teams.",
        "Complete adherence to the planned release schedule with 100% approval rate of the product stakeholders."
      ]
    },
  	{
  		"show" : true,
      "is_current" : false,
      "position" : "Information Systems Analyst II",
      "company" : "Governance Commission for Government-Owned or Controlled Corporations (GCG)",
      "division" : "Information and Communications Technology Group – Application Management Division",
      "duration" : "May 2019 - April 2021",
      "duties" : [
        "Provided technical assistance and support on troubleshooting and maintaining existing internal and external applications of GCG to ensure service continuity; and",
        "Conducted research and recommends innovative approaches to improve the service provisioning of the applications of the organization"
      ],
      "achievements": [
        "Efficiently utilized and implemented infographics on email advisories sent to the stakeholders of the ICRS resulting to reduced number of emails and phone inquiries received by the team; and",
        "Established a centralized working tracker for the ICRS through the creation of an .xlsx file as an initiative to have a single file that is easy to access by the team to get relevant information relating to the ICRS."
      ]
  	},
    {
      "show" : true,
      "is_current" : false,
      "position" : "Junior Software Engineer",
      "company" : "Governance Commission for Government-Owned or Controlled Corporations (GCG)",
      "division" : "Information and Communications Technology Group – Application Management Division",
      "duration" : "July 2017 - May 2019",
      "duties" : [
        "Provided support in the enhancement of the applications/modules of the Integrated Corporate Reporting System (ICRS) based on defined specifications of the product-owners; and",
        "Provided support in preparing required documentations, including both program-level and user-level documentation."
      ],
      "achievements" : [
        "Established standard templates and correspondences resulting to a more improved and efficient approach of addressing the received concerns and/or inquiries by the team; and",
        "Provided comprehensive layout and content for the user manuals used for the sub-components of the ICRS."
      ]
    },
    {
      "show" : true,
      "is_current" : false,
      "position" : "Web Developer I",
      "company" : "Note-e-fied Philippines, Inc.",
      "division" : "",
      "duration" : "October 2016 - June 2017",
      "duties" : [
        "Contributed in the development of a new SaaS (Software as a Service) application ensuring that it meets all requirements of quality, security, modifiability, and extensibility; and",
        "Enhanced the modules of the existing issue tracking system utilized by the Web Developers, SQA, and Software Support Specialists."
      ],
      "achievements": [
        "Successfully implemented a Kanban Board in the issue tracking system of Note-e-fied Phils., Inc.; and",
        "Supervised six (6) interns during their practicum in Note-e-fied Phils., Inc."
      ]
    },
    {
      "show" : true,
      "is_current" : false,
      "position" : "Software Support Specialist",
      "company" : "Note-e-fied Philippines, Inc.",
      "division" : "",
      "duration" : "June 2015 - October 2016",
      "duties" : [
        "Provided support to customers by resolving their concerns and inquiries while ensuring adherence to the company standards; and",
        "Documented the reported concerns/issues of the customer and escalated it if needed to the appropriate officer/staff for their review and/or appropriate action."
      ],
      "achievements": [
        "Developed a web-based application to monitor Software Support Specialists’ performance based on their Key Performance Indicator; and",
        "Successfully resolved issues that occurred during processing of claim submissions of Home Health and Hospice Agencies."
      ]
    }
  ],
  "otherjob" : [
    {
      "show" : true,
      "is_current" : false,
      "position" : "Part-time Faculty",
      "company" : "University of the Immaculate Conception",
      "division" : "Information and Technology Education (ITE) Program",
      "duration" : "June 2015 - October 2015",
      "duties" : [
        "Taught both core and elective subjects in the field specialization as allocated by the Head of the Program offered by the University; and",
        "Conducted laboratory courses, tutorials and seminars of the subject assigned in an effective manner, so as to improve the practical knowledge of the student."
      ],
      "achievements": []
    },
    {
      "show" : true,
      "is_current" : false,
      "position" : "EZ Tech Instructor",
      "company" : "University of the Immaculate Conception",
      "division" : "Information and Technology Education (ITE) Program",
      "duration" : "June 2015 - October 2015",
      "duties" : [
        "Conducted basic to intermediate Website Designing class particularly in the usage of Hypertext Markup Language (HTML) and Cascading Style Sheets (CSS); and",
        "Discussed and taught basic to intermediate knowledge on Microsoft Office Applications (e.g. Word, PowerPoint, Excel, etc.)."
      ],
      "achievements": []
    },
    {
      "show" : true,
      "is_current" : false,
      "position" : "Market Research Interviewer",
      "company" : "Survey Sampling International, Inc.",
      "division" : "",
      "duration" : "April 2014 - July 2014",
      "duties" : [
        "Ensured that the interviews conducted are done with the highest level of quality by properly administering each survey without falsification of data and bias;",
        "Recorded respondent’s answers with 100% accuracy, including typing respondent’s verbal answers in verbatim to survey questions and meet assigned quota for survey collection; and",
        "Performed survey research by using proper interviewing techniques and adhering to strict methodologies and guidelines."
      ],
      "achievements": []
    },
    {
      "show" : true,
      "is_current" : false,
      "position" : "Seasonal Sales and Customer Service Representative",
      "company" : "Cyber City Teleservices, Inc. an IQOR Company",
      "division" : "1800Flowers.com",
      "duration" : "April 2013 - May 2013",
      "duties" : [
        "Mastered all products and applications by demonstrating ongoing competency;",
        "Assisted customers with backorders and other related service issues;",
        "Answered incoming phone calls and inquiries. Routed calls and messages within the management system to appropriate staff; and",
        "Resolved customer complaints in accordance with Company Policy and advised sales management promptly of any situation beyond the Sales Representative’s Authority. "
      ],
      "achievements": []
    }
  ]
}
